tap "buildpacks/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"

brew "neovim"
brew "nvm"
brew "starship"
brew "uv"

brew "buildpacks/tap/pack"

cask "font-go-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"

cask "1password-cli"
cask "arc"
cask "datagrip"
cask "firefox"
cask "podman-desktop"
cask "postman"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"

vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
