tap "buildpacks/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"

brew "aws-console"
brew "awscli"
brew "coreutils"
brew "direnv"
brew "dotnet@8"
brew "httpie" # replacement for 'curl'
brew "jq"
brew "neovim"
brew "nvm"
brew "openssl@3"
brew "sqlite"
brew "starship"
brew "terraform"
brew "uv"

# brew "aws-sam-cli"
# brew "saml2aws"
# brew "gh"
# brew "temporal" # orchestration engine

brew "buildpacks/tap/pack"

cask "1password-cli"
cask "arc"
cask "font-go-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "datagrip"
cask "firefox"
cask "podman-desktop"
cask "postman"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"

vscode "alexkrechik.cucumberautocomplete"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arcanis.vscode-zipfs"
vscode "atlassian.atlascode"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "boto3typed.boto3-ide"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "danishsarwar.reverse-search"
vscode "dannysteenman.cloudformation-yaml-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "firsttris.vscode-jest-runner"
vscode "flowtype.flow-for-vscode"
vscode "folke.vscode-monorepo-workspace"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "gruntfuggly.mermaid-export"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "iliazeus.vscode-ansi"
vscode "irongeek.vscode-env"
vscode "joostlubach.js-index"
vscode "kangping.protobuf"
vscode "kddejong.vscode-cfn-lint"
vscode "liamhammett.inline-parameters"
vscode "matt-meyers.vscode-dbml"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "netcorext.uuid-generator"
vscode "orta.vscode-jest"
vscode "paulshestakov.aws-step-functions-constructor"
vscode "searking.preview-vscode"
vscode "sleistner.vscode-fileutils"
vscode "smartbearsoftware.vscode-swaggerhub"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sonarsource.sonarlint-vscode"
vscode "stevensona.character-count"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "tuxtina.json2yaml"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "webdevsnyc.aws-sam-snippets"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
